386bsd/386bsd/usr/local/man/man7/groff_mmse.7
.\"
.\" Skrivet av Jörgen Hägg, Lund, Sverige
.\"
.TH GROFF_MMSE 7 "21 February 1993" "Groff Version 1.09"
.SH NAMN
groff_mmse \- svenska mm makro för groff
.SH SYNTAX
.B groff
.B \-mgmse
[
.IR flaggor .\|.\|.
]
[
.IR filer .\|.\|.
]
.SH BESKRIVNING
\fBmgmse\fP är en svensk variant av \fBmgm\fP. Alla texter
är översatta. En A4 sida får text som är 13 cm bred, 3.5 cm indragning
samt är 28.5 cm hög.
.LP
\fBCOVER\fP kan använda \fIse_ms\fP som argument. Detta ger ett
svenskt försättsblad.
Se \fBgroff_mm(7)\fP för övriga detaljer.
.SH "SKRIVET AV"
Jörgen Hägg, Lunds Tekniska Högskola <jh@efd.lth.se>
.SH FILER
.B /usr/lib/groff/tmac/tmac.gmse
.B /usr/lib/groff/tmac/mm/se_*.cov
.SH "SE OCKSÅ"
.BR groff (1),
.BR gtroff (1),
.BR gtbl (1),
.BR gpic (1),
.BR geqn (1)
.br
.BR mgm (7)
