386bsd/386bsd/usr/src/kernel/dosfs/dosfs.4
.\" Copyright (c) 1994 William F. Jolitz, TeleMuse
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This software is a component of "386BSD" developed by 
.\"	William F. Jolitz, TeleMuse.
.\" 4. Neither the name of the developer nor the name "386BSD"
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 5. Non-commercial distribution of this complete file in either source and/or
.\"    binary form at no charge to the user (such as from an official Internet 
.\"    archive site) is permitted. 
.\" 6. Commercial distribution and sale of this complete file in either source
.\"    and/or binary form on any media, including that of floppies, tape, or 
.\"    CD-ROM, or through a per-charge download such as that of a BBS, is not 
.\"    permitted without specific prior written permission.
.\" 7. Non-commercial and/or commercial distribution of an incomplete, altered, 
.\"    or otherwise modified file in either source and/or binary form is not 
.\"    permitted.
.\"
.\" THIS SOFTWARE IS A COMPONENT OF 386BSD DEVELOPED BY WILLIAM F. JOLITZ 
.\" AND IS INTENDED FOR RESEARCH AND EDUCATIONAL PURPOSES ONLY. THIS 
.\" SOFTWARE SHOULD NOT BE CONSIDERED TO BE A COMMERCIAL PRODUCT. 
.\" THE DEVELOPER URGES THAT USERS WHO REQUIRE A COMMERCIAL PRODUCT 
.\" NOT MAKE USE OF THIS WORK.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPER ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE DEVELOPER BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" Software module configuration.
.\"
.\"
.\"     $Id: dosfs.4,v 1.1 94/10/19 23:46:44 bill Exp $
.\"
.Dd March 28, 1994
.Dt DOSFS 4
.Os 386BSD 1
.Sh NAME
.Nm dosfs
.Nd MS-DOS FAT file system
.Sh SYNOPSIS
.Nm dosfs fs_idx.
.Sh DESCRIPTION
The
.Xr dosfs 4
filesystem provides support for a MS DOS formatted hard disk partition or
floppy disk to be mounted on the system's filesystem tree, allowing DOS
files to be directly accessible by all user programs.
.Pp
Since DOS file and directory names and attributes do not correspond to
POSIX names and attributes, the filesystem implementation partially compensates
for these limitations for the convienence of the user. File and directory
names are silently truncated and case-wrapped to 7 character lowercase
characters and numbers (11 if the 8th is a period). While the names are
recorded internally as upper case only, case is always mapped to lower
case on filename lookup and creation. Filenames ending in a period have
the period silently dropped as well. Files can only be made "system read
only" regardless of user, as only the single write bit per file is present
(the hidden and archived attribute bits are not implemented). While all
files appear to be owned by root, any user can alter contents and attributes
at will (so the only protection present is that of the mount directory itself).
Read and execute attribute bits are always set for user, group, and other.
The write protect attribute bit can only be set from the user set (where
it will appear to set them all).
.Pp
In addition, all time attributes reported are always the time of last
modification. Since times are kept in local time, times fitfully correspond
to DOS interpretations.
.Sh AUTHOR
.Xr dosfs 4
was written by Paul Popelka.
